dev/io.openliberty.jaxws_fat/test-applications/defaultpackage/resources/WEB-INF/EchoStringService.wsdl

<?xml version="1.0" encoding="UTF-8" standalone="yes"?>
<!-- Generated by JAX-WS RI (http://jax-ws.java.net). RI's version is JAX-WS RI 2.2.10 svn-revision#919b322c92f13ad085a933e8dd6dd35d4947364b. -->
<definitions targetNamespace="http://jaxws.basic.cxf.fats/" name="EchoStringService" xmlns="http://schemas.xmlsoap.org/wsdl/" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:tns="http://server.wsfvt.defaultpackage.jaxws/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata">
  <types>
    <xsd:schema>
      <xsd:import namespace="http://jaxws.basic.cxf.fats/" schemaLocation="EchoStringService_schema1.xsd"/>
    </xsd:schema>
  </types>
  <message name="echo">
    <part name="echo" element="tns:echo"/>
  </message>
  <message name="echoResponse">
    <part name="echoResponse" element="tns:echoResponse"/>
  </message>
  <portType name="EchoString">
    <operation name="echo">
      <input wsam:Action="http://jaxws.basic.cxf.fats/EchoString/echoRequest" message="tns:echo"/>
      <output wsam:Action="http://jaxws.basic.cxf.fats/EchoString/echoResponse" message="tns:echoResponse"/>
    </operation>
  </portType>
  <binding name="EchoStringPortBinding" type="tns:EchoString">
    <soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"/>
    <operation name="echo">
      <soap:operation soapAction=""/>
      <input>
        <soap:body use="literal"/>
      </input>
      <output>
        <soap:body use="literal"/>
      </output>
    </operation>
  </binding>
  <service name="EchoStringService">
    <port name="EchoStringPort" binding="tns:EchoStringPortBinding">
      <soap:address location="http://localhost:8010/jaxws/defaultpackage/EchoStringService"/>
    </port>
  </service>
</definitions>

